jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
#include "../../hal_target.h"
#if HAL_TARGET_IS_RP2040
#include "../../hal_config.h"

#ifdef HAL_ENABLE_TCP

#include "../../hal_serial.h"
#include "../../hal_sync.h"
#include "../../hal_system.h"
#include "../../hal_tcp.h"
#include "../shared/hal_mutex_once.h"

#if defined(HAL_NETWORK_BACKEND_CYW43)
#include "../shared/network/jh_lwip_tcp.h"
#include "drivers/rp2040/rp2040_cyw43_provider.h"
#include "rp2040_network_lifecycle.h"
#else
#include <Arduino.h>
#include <IPAddress.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#endif
#include <limits.h>

struct hal_tcp_socket_impl_t {
#if defined(HAL_NETWORK_BACKEND_CYW43)
  jh_lwip_tcp_socket_t client;
#else
  WiFiClient client;
#endif
  bool in_use;
  bool connected;
  hal_net_endpoint_t remote_endpoint;
};

struct hal_tcp_listener_impl_t {
#if defined(HAL_NETWORK_BACKEND_CYW43)
  jh_lwip_tcp_listener_t listener;
#else
  WiFiServer server;
#endif
  bool in_use;
  bool bound;
  bool listening;
  hal_net_endpoint_t local_endpoint;
#if !defined(HAL_NETWORK_BACKEND_CYW43)
  WiFiClient pending_client;
  bool has_pending_client;
#endif
  uint8_t backlog;
};

static hal_tcp_socket_impl_t s_tcp_pool[HAL_TCP_SOCKET_MAX_INSTANCES];
static hal_tcp_listener_impl_t
    s_tcp_listener_pool[HAL_TCP_LISTENER_MAX_INSTANCES];
static hal_mutex_t s_tcp_mutex = NULL;

static inline void tcp_ensure_mutex(void) {
  (void)jh_hal_mutex_create_once(&s_tcp_mutex);
}

#if defined(HAL_NETWORK_BACKEND_CYW43)
static void reset_socket_state_locked(hal_tcp_socket_impl_t *socket);
static void reset_listener_state_locked(hal_tcp_listener_impl_t *listener);

extern "C" hal_status_t jh_rp2040_tcp_reset_all(void) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
  if (status == HAL_OK) {
    for (size_t index = 0u; index < HAL_TCP_SOCKET_MAX_INSTANCES; ++index) {
      if (s_tcp_pool[index].in_use) {
        jh_lwip_tcp_socket_close(&s_tcp_pool[index].client);
        reset_socket_state_locked(&s_tcp_pool[index]);
        s_tcp_pool[index].in_use = false;
      }
    }
    for (size_t index = 0u; index < HAL_TCP_LISTENER_MAX_INSTANCES; ++index) {
      if (s_tcp_listener_pool[index].in_use) {
        jh_lwip_tcp_listener_close(&s_tcp_listener_pool[index].listener);
        reset_listener_state_locked(&s_tcp_listener_pool[index]);
        s_tcp_listener_pool[index].in_use = false;
      }
    }
    jh_rp2040_cyw43_provider_lwip_end();
  }
  hal_mutex_unlock(s_tcp_mutex);
  return status;
}
#endif

static void reset_endpoint(hal_net_endpoint_t *endpoint) {
  if (!endpoint) {
    return;
  }
  endpoint->family = HAL_NET_AF_UNSPEC;
  endpoint->addr[0] = 0u;
  endpoint->addr[1] = 0u;
  endpoint->addr[2] = 0u;
  endpoint->addr[3] = 0u;
  endpoint->port = 0u;
}

static bool validate_endpoint(const hal_net_endpoint_t *endpoint,
                              const char *fn, const char *name) {
  if (!endpoint) {
    hal_derr("%s: %s endpoint is NULL", fn, name);
    return false;
  }
  if (endpoint->family != HAL_NET_AF_INET) {
    hal_derr("%s: %s endpoint family is unsupported", fn, name);
    return false;
  }
  if (endpoint->port == 0u) {
    hal_derr("%s: %s endpoint port must be > 0", fn, name);
    return false;
  }
  return true;
}

static bool is_valid_socket_locked(hal_tcp_socket_t socket) {
  for (size_t i = 0u; i < HAL_TCP_SOCKET_MAX_INSTANCES; ++i) {
    if (socket == &s_tcp_pool[i] && s_tcp_pool[i].in_use) {
      return true;
    }
  }
  return false;
}

static bool is_valid_listener_locked(hal_tcp_listener_t listener) {
  for (size_t i = 0u; i < HAL_TCP_LISTENER_MAX_INSTANCES; ++i) {
    if (listener == &s_tcp_listener_pool[i] && s_tcp_listener_pool[i].in_use) {
      return true;
    }
  }
  return false;
}

#if !defined(HAL_NETWORK_BACKEND_CYW43)
static IPAddress ip_address_from_endpoint(const hal_net_endpoint_t *endpoint) {
  return IPAddress(endpoint->addr[0], endpoint->addr[1], endpoint->addr[2],
                   endpoint->addr[3]);
}

static void endpoint_from_ip_address(const IPAddress &ip, uint16_t port,
                                     hal_net_endpoint_t *out) {
  if (!out) {
    return;
  }
  out->family = HAL_NET_AF_INET;
  out->addr[0] = (uint8_t)ip[0];
  out->addr[1] = (uint8_t)ip[1];
  out->addr[2] = (uint8_t)ip[2];
  out->addr[3] = (uint8_t)ip[3];
  out->port = port;
}

static unsigned long stream_timeout_from_ms(uint32_t timeout_ms) {
  if (timeout_ms == HAL_NET_TIMEOUT_FOREVER) {
    return ULONG_MAX;
  }
  return (unsigned long)timeout_ms;
}
#endif

static uint8_t capped_backlog(uint8_t backlog) {
  if ((size_t)backlog > (size_t)HAL_TCP_LISTENER_BACKLOG_MAX) {
    return (uint8_t)HAL_TCP_LISTENER_BACKLOG_MAX;
  }
  return backlog;
}

static void reset_socket_state_locked(hal_tcp_socket_impl_t *socket) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
  jh_lwip_tcp_socket_init(&socket->client);
#else
  socket->client.stop();
#endif
  socket->connected = false;
  reset_endpoint(&socket->remote_endpoint);
}

static hal_tcp_socket_t allocate_socket_locked(void) {
  for (size_t i = 0u; i < HAL_TCP_SOCKET_MAX_INSTANCES; ++i) {
    if (!s_tcp_pool[i].in_use) {
      reset_socket_state_locked(&s_tcp_pool[i]);
      s_tcp_pool[i].in_use = true;
      return &s_tcp_pool[i];
    }
  }
  return NULL;
}

#if !defined(HAL_NETWORK_BACKEND_CYW43)
static void drain_unaccepted_clients_locked(hal_tcp_listener_impl_t *listener) {
  if (listener->has_pending_client) {
    listener->pending_client.stop();
    listener->pending_client = WiFiClient();
    listener->has_pending_client = false;
  }

  for (;;) {
    WiFiClient client = listener->server.accept();
    if (!client) {
      break;
    }
    client.stop();
  }
}
#endif

static void reset_listener_state_locked(hal_tcp_listener_impl_t *listener) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
  jh_lwip_tcp_listener_init(&listener->listener);
#else
  listener->pending_client = WiFiClient();
  listener->has_pending_client = false;
#endif
  listener->backlog = 0u;
  listener->bound = false;
  listener->listening = false;
  reset_endpoint(&listener->local_endpoint);
}

hal_status_t hal_tcp_socket_open_ex(hal_tcp_socket_t *out_socket) {
  if (!out_socket) {
    return HAL_EINVAL;
  }
  *out_socket = NULL;
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  *out_socket = allocate_socket_locked();

  hal_mutex_unlock(s_tcp_mutex);

