jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
  if (!*out_socket) {
    hal_derr("hal_tcp_socket_open: socket pool exhausted");
    return HAL_ENOMEM;
  }
  return HAL_OK;
}

hal_tcp_socket_t hal_tcp_socket_open(void) {
  hal_tcp_socket_t socket = NULL;
  (void)hal_tcp_socket_open_ex(&socket);
  return socket;
}

hal_status_t hal_tcp_socket_connect_ex(hal_tcp_socket_t socket,
                                       const hal_net_endpoint_t *remote,
                                       uint32_t timeout_ms) {
  if (!validate_endpoint(remote, "hal_tcp_socket_connect", "remote")) {
    return HAL_EINVAL;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (!is_valid_socket_locked(socket)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_socket_connect: socket handle is invalid");
    return HAL_EINVAL;
  }

#if defined(HAL_NETWORK_BACKEND_CYW43)
  socket->connected = false;
  socket->remote_endpoint = *remote;
  ip4_addr_t remote_address;
  IP4_ADDR(&remote_address, remote->addr[0], remote->addr[1], remote->addr[2],
           remote->addr[3]);
  hal_status_t connect_status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (connect_status == HAL_OK) {
    jh_lwip_tcp_socket_close(&socket->client);
    connect_status = jh_lwip_tcp_socket_connect(&socket->client,
                                                &remote_address, remote->port);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  hal_mutex_unlock(s_tcp_mutex);
  if (connect_status != HAL_OK) {
    return connect_status;
  }

  const uint32_t start_ms = hal_millis();
  for (;;) {
    hal_mutex_lock(s_tcp_mutex);
    if (!is_valid_socket_locked(socket)) {
      hal_mutex_unlock(s_tcp_mutex);
      return HAL_EINVAL;
    }
    hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    if (status == HAL_OK) {
      status = jh_lwip_tcp_socket_connection_status(&socket->client);
      socket->connected = status == HAL_OK;
      jh_rp2040_cyw43_provider_lwip_end();
    }
    hal_mutex_unlock(s_tcp_mutex);

    if (status == HAL_OK) {
      return HAL_OK;
    }
    if (status != HAL_EAGAIN) {
      return status;
    }
    if (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
        (uint32_t)(hal_millis() - start_ms) >= timeout_ms) {
      hal_mutex_lock(s_tcp_mutex);
      const hal_status_t context_status =
          jh_rp2040_cyw43_provider_lwip_begin(false);
      if (context_status == HAL_OK) {
        jh_lwip_tcp_socket_close(&socket->client);
        jh_rp2040_cyw43_provider_lwip_end();
      }
      socket->connected = false;
      hal_mutex_unlock(s_tcp_mutex);
      return HAL_ETIMEOUT;
    }
    hal_idle();
    hal_delay_ms(1u);
  }
#else
  socket->client.stop();
  socket->connected = false;
  socket->remote_endpoint = *remote;
  socket->client.setTimeout(stream_timeout_from_ms(timeout_ms));

  const IPAddress remote_ip = ip_address_from_endpoint(remote);
  const int ok = socket->client.connect(remote_ip, remote->port);
  socket->connected = (ok == 1);

  hal_mutex_unlock(s_tcp_mutex);

  if (ok != 1) {
    hal_derr("hal_tcp_socket_connect: connect failed");
  }
  return ok == 1 ? HAL_OK : HAL_EIO;
#endif
}

bool hal_tcp_socket_connect(hal_tcp_socket_t socket,
                            const hal_net_endpoint_t *remote,
                            uint32_t timeout_ms) {
  return hal_status_to_bool(
      hal_tcp_socket_connect_ex(socket, remote, timeout_ms));
}

hal_status_t hal_tcp_socket_send_ex(hal_tcp_socket_t socket, const void *data,
                                    size_t len, size_t *out_sent) {
  if (out_sent) {
    *out_sent = 0u;
  }
  if (!out_sent) {
    return HAL_EINVAL;
  }
  if (len > 0u && data == NULL) {
    hal_derr("hal_tcp_socket_send: data is NULL while len > 0");
    return HAL_EINVAL;
  }
  if (len > (size_t)INT_MAX) {
    hal_derr("hal_tcp_socket_send: payload is too large");
    return HAL_EOVERFLOW;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (!is_valid_socket_locked(socket)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_socket_send: socket is invalid");
    return HAL_EINVAL;
  }
#if defined(HAL_NETWORK_BACKEND_CYW43)
  hal_status_t send_status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (send_status != HAL_OK) {
    socket->connected = false;
    hal_mutex_unlock(s_tcp_mutex);
    return send_status;
  }
  socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);
  if (!socket->connected) {
    jh_rp2040_cyw43_provider_lwip_end();
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_socket_send: socket is invalid or not connected");
    return HAL_ESTATE;
  }
  if (!jh_lwip_tcp_socket_can_send(&socket->client)) {
    jh_rp2040_cyw43_provider_lwip_end();
    hal_mutex_unlock(s_tcp_mutex);
    return HAL_EAGAIN;
  }

  send_status = jh_lwip_tcp_socket_send(&socket->client, data, len, out_sent);
  jh_rp2040_cyw43_provider_lwip_end();
  hal_mutex_unlock(s_tcp_mutex);
  return send_status;
#else
  if (!socket->connected || !socket->client.connected()) {
    if (is_valid_socket_locked(socket)) {
      socket->connected = false;
    }
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_socket_send: socket is invalid or not connected");
    return HAL_ESTATE;
  }

  size_t written = 0u;
  if (len > 0u) {
    written = socket->client.write((const uint8_t *)data, len);
  }

  hal_mutex_unlock(s_tcp_mutex);
  *out_sent = written;
  return HAL_OK;
#endif
}

int hal_tcp_socket_send(hal_tcp_socket_t socket, const void *data, size_t len) {
  size_t sent = 0u;
  return hal_status_is_ok(hal_tcp_socket_send_ex(socket, data, len, &sent))
             ? (int)sent
             : -1;
}

hal_status_t hal_tcp_socket_recv_ex(hal_tcp_socket_t socket, void *buffer,
                                    size_t max_len, uint32_t timeout_ms,
                                    size_t *out_received) {
  if (out_received) {
    *out_received = 0u;
  }
  if (!out_received) {
    return HAL_EINVAL;
  }
  if (max_len > 0u && buffer == NULL) {
    hal_derr("hal_tcp_socket_recv: buffer is NULL while max_len > 0");
    return HAL_EINVAL;
  }
  if (max_len > (size_t)INT_MAX) {
    return HAL_EOVERFLOW;
  }

  const uint32_t start_ms = hal_millis();

