jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
  for (;;) {
    tcp_ensure_mutex();
    hal_mutex_lock(s_tcp_mutex);

    if (!is_valid_socket_locked(socket)) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_socket_recv: socket handle is invalid");
      return HAL_EINVAL;
    }

#if defined(HAL_NETWORK_BACKEND_CYW43)
    hal_status_t receive_status = jh_rp2040_cyw43_provider_lwip_begin(false);
    if (receive_status != HAL_OK) {
      hal_mutex_unlock(s_tcp_mutex);
      return receive_status;
    }
    const size_t available = jh_lwip_tcp_socket_available(&socket->client);
    socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);

    if (available > 0u) {
      receive_status = jh_lwip_tcp_socket_receive(&socket->client, buffer,
                                                  max_len, out_received);
      socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
      hal_mutex_unlock(s_tcp_mutex);
      return receive_status;
    }
    const bool connected = socket->connected;
    jh_rp2040_cyw43_provider_lwip_end();
    if (!connected) {
      hal_mutex_unlock(s_tcp_mutex);
      return HAL_OK;
    }
#else
    const int available = socket->client.available();
    const bool backend_connected = socket->client.connected() != 0u;
    socket->connected = backend_connected || available > 0;

    if (!socket->connected) {
      hal_mutex_unlock(s_tcp_mutex);
      return HAL_OK;
    }

    if (available > 0) {
      int to_read = available;
      if ((size_t)to_read > max_len) {
        to_read = (int)max_len;
      }

      int read_count = 0;
      if (to_read > 0) {
        read_count = socket->client.read((uint8_t *)buffer, (size_t)to_read);
      }

      hal_mutex_unlock(s_tcp_mutex);
      if (read_count < 0) {
        return HAL_EIO;
      }
      *out_received = (size_t)read_count;
      return HAL_OK;
    }
#endif

    hal_mutex_unlock(s_tcp_mutex);

    if (timeout_ms == 0u) {
      return HAL_OK;
    }
    if (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
        (uint32_t)(hal_millis() - start_ms) >= timeout_ms) {
      return HAL_OK;
    }

    hal_idle();
    hal_delay_ms(1u);
  }
}

int hal_tcp_socket_recv(hal_tcp_socket_t socket, void *buffer, size_t max_len,
                        uint32_t timeout_ms) {
  size_t received = 0u;
  return hal_status_is_ok(hal_tcp_socket_recv_ex(socket, buffer, max_len,
                                                 timeout_ms, &received))
             ? (int)received
             : -1;
}

bool hal_tcp_socket_can_recv(hal_tcp_socket_t socket) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool ready = false;
  if (is_valid_socket_locked(socket)) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      ready = jh_lwip_tcp_socket_available(&socket->client) > 0u;
      socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
#else
    const int available = socket->client.available();
    const bool backend_connected = socket->client.connected() != 0u;
    socket->connected = backend_connected || available > 0;
    ready = available > 0;
#endif
  }

  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

bool hal_tcp_socket_can_send(hal_tcp_socket_t socket) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool ready = false;
  if (is_valid_socket_locked(socket)) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      ready = jh_lwip_tcp_socket_can_send(&socket->client);
      socket->connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
#else
    const int available = socket->client.available();
    const bool backend_connected = socket->client.connected() != 0u;
    socket->connected = backend_connected || available > 0;
    ready = socket->connected && backend_connected;
#endif
  }

  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

bool hal_tcp_socket_is_connected(hal_tcp_socket_t socket) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool connected = false;
  if (is_valid_socket_locked(socket)) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      connected = jh_lwip_tcp_socket_is_connected(&socket->client);
      socket->connected = connected;
      jh_rp2040_cyw43_provider_lwip_end();
    }
#else
    const int available = socket->client.available();
    connected = socket->connected &&
                (socket->client.connected() != 0u || available > 0);
    socket->connected = connected;
#endif
  }

  hal_mutex_unlock(s_tcp_mutex);
  return connected;
}

void hal_tcp_socket_shutdown(hal_tcp_socket_t socket) {
  if (!socket) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (is_valid_socket_locked(socket)) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      jh_lwip_tcp_socket_close(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
#else
    socket->client.stop();
#endif
    socket->connected = false;
    reset_endpoint(&socket->remote_endpoint);
  }

  hal_mutex_unlock(s_tcp_mutex);
}

void hal_tcp_socket_close(hal_tcp_socket_t socket) {
  if (!socket) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (is_valid_socket_locked(socket)) {
#if defined(HAL_NETWORK_BACKEND_CYW43)
    const hal_status_t context_status =
        jh_rp2040_cyw43_provider_lwip_begin(false);
    if (context_status == HAL_OK) {
      jh_lwip_tcp_socket_close(&socket->client);
      jh_rp2040_cyw43_provider_lwip_end();
    }
#endif
    reset_socket_state_locked(socket);
    socket->in_use = false;
  }

  hal_mutex_unlock(s_tcp_mutex);
}

