jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
#if defined(HAL_NETWORK_BACKEND_CYW43)

hal_status_t hal_tcp_listener_open_ex(hal_tcp_listener_t *out_listener) {
  if (!out_listener) {
    return HAL_EINVAL;
  }
  *out_listener = NULL;
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  for (size_t i = 0u; i < HAL_TCP_LISTENER_MAX_INSTANCES; ++i) {
    if (!s_tcp_listener_pool[i].in_use) {
      reset_listener_state_locked(&s_tcp_listener_pool[i]);
      s_tcp_listener_pool[i].in_use = true;
      *out_listener = &s_tcp_listener_pool[i];
      break;
    }
  }

  hal_mutex_unlock(s_tcp_mutex);
  if (!*out_listener) {
    hal_derr("hal_tcp_listener_open: listener pool exhausted");
    return HAL_ENOMEM;
  }
  return HAL_OK;
}

hal_tcp_listener_t hal_tcp_listener_open(void) {
  hal_tcp_listener_t listener = NULL;
  (void)hal_tcp_listener_open_ex(&listener);
  return listener;
}

hal_status_t hal_tcp_listener_bind_ex(hal_tcp_listener_t listener,
                                      const hal_net_endpoint_t *local) {
  if (!validate_endpoint(local, "hal_tcp_listener_bind", "local")) {
    return HAL_EINVAL;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  if (!is_valid_listener_locked(listener)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_bind: listener handle is invalid");
    return HAL_EINVAL;
  }

  ip4_addr_t local_address;
  IP4_ADDR(&local_address, local->addr[0], local->addr[1], local->addr[2],
           local->addr[3]);
  hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(true);
  const bool context_active = status == HAL_OK;
  if (status == HAL_OK) {
    status = jh_lwip_tcp_listener_bind(&listener->listener, &local_address,
                                       local->port);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  if (status == HAL_OK) {
    listener->local_endpoint = *local;
    listener->bound = true;
    listener->listening = false;
    listener->backlog = 0u;
  } else if (context_active) {
    reset_listener_state_locked(listener);
  }
  hal_mutex_unlock(s_tcp_mutex);
  return status;
}

bool hal_tcp_listener_bind(hal_tcp_listener_t listener,
                           const hal_net_endpoint_t *local) {
  return hal_status_to_bool(hal_tcp_listener_bind_ex(listener, local));
}

hal_status_t hal_tcp_listener_listen_ex(hal_tcp_listener_t listener,
                                        uint8_t backlog) {
  if (backlog == 0u) {
    hal_derr("hal_tcp_listener_listen: backlog must be > 0");
    return HAL_EINVAL;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  if (!is_valid_listener_locked(listener)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_listen: listener is invalid");
    return HAL_EINVAL;
  }
  if (!listener->bound) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_listen: listener is not bound");
    return HAL_ESTATE;
  }

  const uint8_t effective_backlog = capped_backlog(backlog);
  hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(true);
  if (status == HAL_OK) {
    status =
        jh_lwip_tcp_listener_listen(&listener->listener, effective_backlog);
    jh_rp2040_cyw43_provider_lwip_end();
  }
  if (status == HAL_OK) {
    listener->backlog = effective_backlog;
    listener->listening = true;
  }
  hal_mutex_unlock(s_tcp_mutex);
  return status;
}

bool hal_tcp_listener_listen(hal_tcp_listener_t listener, uint8_t backlog) {
  return hal_status_to_bool(hal_tcp_listener_listen_ex(listener, backlog));
}

hal_status_t hal_tcp_listener_accept_ex(hal_tcp_listener_t listener,
                                        hal_net_endpoint_t *remote,
                                        uint32_t timeout_ms,
                                        hal_tcp_socket_t *out_socket) {
  if (!out_socket) {
    return HAL_EINVAL;
  }
  *out_socket = NULL;
  const uint32_t start_ms = hal_millis();

  for (;;) {
    tcp_ensure_mutex();
    hal_mutex_lock(s_tcp_mutex);
    if (!is_valid_listener_locked(listener)) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_listener_accept: listener is invalid");
      return HAL_EINVAL;
    }
    if (!listener->listening) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_listener_accept: listener is not listening");
      return HAL_ESTATE;
    }

    hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    const bool context_active = status == HAL_OK;
    hal_tcp_socket_t socket = NULL;
    if (context_active) {
      if (!jh_lwip_tcp_listener_can_accept(&listener->listener)) {
        status = HAL_EAGAIN;
      } else {
        socket = allocate_socket_locked();
        if (!socket) {
          status = HAL_ENOMEM;
        } else {
          ip4_addr_t remote_address;
          uint16_t remote_port = 0u;
          status =
              jh_lwip_tcp_listener_accept(&listener->listener, &socket->client,
                                          &remote_address, &remote_port);
          if (status == HAL_OK) {
            socket->connected =
                jh_lwip_tcp_socket_is_connected(&socket->client);
            socket->remote_endpoint.family = HAL_NET_AF_INET;
            socket->remote_endpoint.addr[0] = ip4_addr1(&remote_address);
            socket->remote_endpoint.addr[1] = ip4_addr2(&remote_address);
            socket->remote_endpoint.addr[2] = ip4_addr3(&remote_address);
            socket->remote_endpoint.addr[3] = ip4_addr4(&remote_address);
            socket->remote_endpoint.port = remote_port;
          } else {
            reset_socket_state_locked(socket);
            socket->in_use = false;
            socket = NULL;
          }
        }
      }
    }
    if (context_active) {
      jh_rp2040_cyw43_provider_lwip_end();
    }
    hal_mutex_unlock(s_tcp_mutex);

    if (status == HAL_OK && socket) {
      if (remote) {
        *remote = socket->remote_endpoint;
      }
      *out_socket = socket;
      return HAL_OK;
    }
    if (status != HAL_EAGAIN) {
      return status;
    }
    if (timeout_ms == 0u ||
        (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
         (uint32_t)(hal_millis() - start_ms) >= timeout_ms)) {
      return HAL_EAGAIN;
    }
    hal_idle();
    hal_delay_ms(1u);
  }
}

hal_tcp_socket_t hal_tcp_listener_accept(hal_tcp_listener_t listener,
                                         hal_net_endpoint_t *remote,
                                         uint32_t timeout_ms) {
  hal_tcp_socket_t socket = NULL;
  (void)hal_tcp_listener_accept_ex(listener, remote, timeout_ms, &socket);
  return socket;
}

