jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
bool hal_tcp_listener_can_accept(hal_tcp_listener_t listener) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  bool ready = false;
  if (is_valid_listener_locked(listener) && listener->listening) {
    const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    if (status == HAL_OK) {
      ready = jh_lwip_tcp_listener_can_accept(&listener->listener);
      jh_rp2040_cyw43_provider_lwip_end();
    }
  }
  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

void hal_tcp_listener_close(hal_tcp_listener_t listener) {
  if (!listener) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);
  if (is_valid_listener_locked(listener)) {
    const hal_status_t status = jh_rp2040_cyw43_provider_lwip_begin(false);
    if (status == HAL_OK) {
      jh_lwip_tcp_listener_close(&listener->listener);
      jh_rp2040_cyw43_provider_lwip_end();
    }
    reset_listener_state_locked(listener);
    listener->in_use = false;
  }
  hal_mutex_unlock(s_tcp_mutex);
}

#else

hal_status_t hal_tcp_listener_open_ex(hal_tcp_listener_t *out_listener) {
  if (!out_listener) {
    return HAL_EINVAL;
  }
  *out_listener = NULL;
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  for (size_t i = 0u; i < HAL_TCP_LISTENER_MAX_INSTANCES; ++i) {
    if (!s_tcp_listener_pool[i].in_use) {
      drain_unaccepted_clients_locked(&s_tcp_listener_pool[i]);
      s_tcp_listener_pool[i].server.stop();
      reset_listener_state_locked(&s_tcp_listener_pool[i]);
      s_tcp_listener_pool[i].in_use = true;
      *out_listener = &s_tcp_listener_pool[i];
      break;
    }
  }

  hal_mutex_unlock(s_tcp_mutex);

  if (!*out_listener) {
    hal_derr("hal_tcp_listener_open: listener pool exhausted");
    return HAL_ENOMEM;
  }
  return HAL_OK;
}

hal_tcp_listener_t hal_tcp_listener_open(void) {
  hal_tcp_listener_t listener = NULL;
  (void)hal_tcp_listener_open_ex(&listener);
  return listener;
}

hal_status_t hal_tcp_listener_bind_ex(hal_tcp_listener_t listener,
                                      const hal_net_endpoint_t *local) {
  if (!validate_endpoint(local, "hal_tcp_listener_bind", "local")) {
    return HAL_EINVAL;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (!is_valid_listener_locked(listener)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_bind: listener handle is invalid");
    return HAL_EINVAL;
  }

  drain_unaccepted_clients_locked(listener);
  listener->server.stop();
  reset_listener_state_locked(listener);
  listener->local_endpoint = *local;
  listener->bound = true;

  hal_mutex_unlock(s_tcp_mutex);
  return HAL_OK;
}

bool hal_tcp_listener_bind(hal_tcp_listener_t listener,
                           const hal_net_endpoint_t *local) {
  return hal_status_to_bool(hal_tcp_listener_bind_ex(listener, local));
}

hal_status_t hal_tcp_listener_listen_ex(hal_tcp_listener_t listener,
                                        uint8_t backlog) {
  if (backlog == 0u) {
    hal_derr("hal_tcp_listener_listen: backlog must be > 0");
    return HAL_EINVAL;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (!is_valid_listener_locked(listener)) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_listen: listener is invalid");
    return HAL_EINVAL;
  }
  if (!listener->bound) {
    hal_mutex_unlock(s_tcp_mutex);
    hal_derr("hal_tcp_listener_listen: listener is not bound");
    return HAL_ESTATE;
  }

  drain_unaccepted_clients_locked(listener);
  listener->server.stop();
  listener->backlog = capped_backlog(backlog);
  listener->listening = false;
  listener->server.begin(listener->local_endpoint.port, listener->backlog);
  listener->listening = (bool)listener->server;
  const bool listening = listener->listening;
  const uint16_t local_port = listener->local_endpoint.port;

  hal_mutex_unlock(s_tcp_mutex);

  if (!listening) {
    hal_derr("hal_tcp_listener_listen: begin(%u) failed", (unsigned)local_port);
  }
  return listening ? HAL_OK : HAL_EIO;
}

bool hal_tcp_listener_listen(hal_tcp_listener_t listener, uint8_t backlog) {
  return hal_status_to_bool(hal_tcp_listener_listen_ex(listener, backlog));
}

hal_status_t hal_tcp_listener_accept_ex(hal_tcp_listener_t listener,
                                        hal_net_endpoint_t *remote,
                                        uint32_t timeout_ms,
                                        hal_tcp_socket_t *out_socket) {
  if (!out_socket) {
    return HAL_EINVAL;
  }
  *out_socket = NULL;
  const uint32_t start_ms = hal_millis();

  for (;;) {
    tcp_ensure_mutex();
    hal_mutex_lock(s_tcp_mutex);

    if (!is_valid_listener_locked(listener)) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_listener_accept: listener is invalid");
      return HAL_EINVAL;
    }
    if (!listener->listening) {
      hal_mutex_unlock(s_tcp_mutex);
      hal_derr("hal_tcp_listener_accept: listener is not listening");
      return HAL_ESTATE;
    }

    WiFiClient accepted;
    if (listener->has_pending_client) {
      accepted = listener->pending_client;
      listener->pending_client = WiFiClient();
      listener->has_pending_client = false;
    } else {
      accepted = listener->server.accept();
    }
    if (accepted) {
      hal_tcp_socket_t socket = allocate_socket_locked();
      if (!socket) {
        accepted.stop();
        hal_mutex_unlock(s_tcp_mutex);
        hal_derr("hal_tcp_listener_accept: socket pool exhausted");
        return HAL_ENOMEM;
      }

      socket->client = accepted;
      const int available = socket->client.available();
      socket->connected = socket->client.connected() != 0u || available > 0;
      endpoint_from_ip_address(socket->client.remoteIP(),
                               socket->client.remotePort(),
                               &socket->remote_endpoint);
      if (remote) {
        *remote = socket->remote_endpoint;
      }

      hal_mutex_unlock(s_tcp_mutex);
      *out_socket = socket;
      return HAL_OK;
    }

    hal_mutex_unlock(s_tcp_mutex);

