jaszczurtd/JaszczurHAL/src/hal/impl/rp2040/hal_tcp.cpp
    if (timeout_ms == 0u) {
      return HAL_EAGAIN;
    }
    if (timeout_ms != HAL_NET_TIMEOUT_FOREVER &&
        (uint32_t)(hal_millis() - start_ms) >= timeout_ms) {
      return HAL_EAGAIN;
    }

    hal_idle();
    hal_delay_ms(1u);
  }
}

hal_tcp_socket_t hal_tcp_listener_accept(hal_tcp_listener_t listener,
                                         hal_net_endpoint_t *remote,
                                         uint32_t timeout_ms) {
  hal_tcp_socket_t socket = NULL;
  (void)hal_tcp_listener_accept_ex(listener, remote, timeout_ms, &socket);
  return socket;
}

bool hal_tcp_listener_can_accept(hal_tcp_listener_t listener) {
  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  bool ready = false;
  if (is_valid_listener_locked(listener) && listener->listening) {
    if (listener->has_pending_client) {
      ready = true;
    } else {
      WiFiClient accepted = listener->server.accept();
      if (accepted) {
        listener->pending_client = accepted;
        listener->has_pending_client = true;
        ready = true;
      }
    }
  }

  hal_mutex_unlock(s_tcp_mutex);
  return ready;
}

void hal_tcp_listener_close(hal_tcp_listener_t listener) {
  if (!listener) {
    return;
  }

  tcp_ensure_mutex();
  hal_mutex_lock(s_tcp_mutex);

  if (is_valid_listener_locked(listener)) {
    drain_unaccepted_clients_locked(listener);
    listener->server.stop();
    reset_listener_state_locked(listener);
    listener->in_use = false;
  }

  hal_mutex_unlock(s_tcp_mutex);
}

#endif

#endif /* HAL_ENABLE_TCP */
#endif /* HAL_TARGET_IS_RP2040 */
